app/controllers/api/v1/dog_walkings_controller.rb

SELECT "dog_walkings".* FROM "dog_walkings"
SELECT  "dog_walkings".* FROM "dog_walkings" WHERE (scheduled_date >= '2018-12-01') LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      # A Lógica dos filtros foi utilizada para poder se reutilizadas com novos
      #   possíveis parâmetros de datas
      return_filter = params['return_filter']

      if return_filter === 'All'
         @dog_walkings = DogWalking.all
      else
         @dog_walkings = DogWalking.future_walkings
      end
      render json: @dog_walkings.page(params[:page]).per(params[:per_page])

SELECT  "dog_walkings".* FROM "dog_walkings" WHERE "dog_walkings"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
      def set_dog_walking
        @dog_walking = DogWalking.find(params[:id])